juthomas/I2S-ESP32-SD/src/main.cpp
// Lecteur Wav/Mp3/m4a Avec des signaux UDP
// Dependance : https://github.com/schreibfaul1/ESP32-audioI2S
//
// La carte Sd doit etre formatée soit en FAT16 soit en FAT32
// pour le format FAT32, il faut formatter la carte sd avec cet outil:
// https://www.sdcard.org/downloads/formatter/
//
// Les fichiers audios sont à mettre à la racine de la carte SD
//
// Les Signaux UDP possibles sont :
//
// Track : "0" à nombre de tracks audios
//
// Volume : "V 0" à "V 255"
//
// Pause/Resume : "P" pour alterner en pause et reprendre la lecteur,
// "P 0" pour mettre en pause, "P 1" pour reprendre la lecture.
//
// Loop file : "L" pour alterner en looper et ne pas looper,
// "L 0" pour ne pas looper, "L 1" pour looper.
//
// Balance : "B -16" à "B 16"
//
// Jump : "J 60" pour aller à un endroit specifique dans la track,
// 60 = 60 secondes
//
// Tonality : "T -40 0 6" fonctionne comme un equilibreur,
// le premier nombre est le gain pour les graves,
// le deuxieme pour les médiums et le troisieme pour les aigus,
// le gain va de -40 à 6 (en dB)

#include "Arduino.h"
#include "WiFi.h"
#include "jsonParser.h"
#include "ESPAsyncWebServer.h"
#include "Audio.h"
#include "esp_now.h"
#include "esp_wifi.h"
#include "SD.h"
#include "FS.h"
#include "sstream"
#include <algorithm>
#include <Adafruit_NeoPixel.h>
#include "PCF8575.h"
#include "esp32-hal-adc.h"
#include "esp_sleep.h"
#include "driver/rtc_io.h"
#include "Wire.h"

// branchement Carte SD
#define SD_CS 5
#define SPI_MOSI 23
#define SPI_MISO 19
#define SPI_SCK 18

// Branchement Amplificateur I2S
#define I2S_DOUT 25
#define I2S_BCLK 27
#define I2S_LRC 26
#define I2S_ENABLE 17
#define START_BUTTON GPIO_NUM_33
#define CHRG_STATUS 13
#define USB_VOLTAGE_PIN 32
#define BATTERY_VOLTAGE_PIN 34
#define LED_IO4 4
#define PCF_INT_PIN 15
#define PCF_PULL_STATE LOW

// IO expander on I2C
PCF8575 PCF(0x20);
static uint16_t pcfPrevValue = 0xFFFF;
static volatile bool pcfInterruptPending = false;
static bool pcfReady = false;

unsigned int localPort = 8266;     // port de reception UDP

bool loop_file = true;               // Default loop audio files
bool auto_play = false;              // Lit la premiere track au demarrage
bool allow_play_over_playing = false; // Autoriser lancer une piste alors qu'une est deja en lecture
const bool DEBUG = true;             // Afficher les messages dans la console

// Physical configurable buttons are on IO14 and IO16.
// We keep legacy variable names for backward compatibility in saved config/web UI.
const uint8_t BUTTON_GPIO_13 = 14;
const uint8_t BUTTON_GPIO_16 = 16;
const uint16_t BUTTON_DEBOUNCE_MS = 40;
const uint8_t BUTTON_PULL_MODE_UP = 0;
const uint8_t BUTTON_PULL_MODE_DOWN = 1;
const uint8_t BUTTON_PULL_MODE_NONE = 2;
const uint8_t BUTTON_ACTIVE_LEVEL_LOW = 0;
const uint8_t BUTTON_ACTIVE_LEVEL_HIGH = 1;
const uint8_t PCF_PULL_MODE_UP = 0;
const uint8_t PCF_PULL_MODE_DOWN = 1;
const uint8_t PCF_ACTIVE_LEVEL_LOW = 0;
const uint8_t PCF_ACTIVE_LEVEL_HIGH = 1;
const uint8_t PCF_CHANNEL_COUNT = 16;
const uint16_t REMOTE_PLAYBACK_DEDUP_WINDOW_MS = 250;
const uint8_t ESP_NOW_BROADCAST_ADDR[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
const uint8_t ESP_NOW_PACKET_MAGIC = 0xA5;
const uint8_t ESP_NOW_PACKET_VERSION_LEGACY = 0x01;
const uint8_t ESP_NOW_PACKET_VERSION = 0x02;
const uint8_t ESP_NOW_CMD_PLAY_TRACK = 0x01;
const uint8_t DEVICE_MODE_CURRENT = 0;
const uint8_t DEVICE_MODE_MESH = 1;
const uint8_t DEVICE_MODE_AP_OFF = 2;
const uint8_t DEVICE_MODE_RELAY_ONLY = 3;
const uint8_t MESH_DEFAULT_TTL = 3;
const uint8_t MESH_MAX_TTL = 8;
const uint8_t MESH_SEEN_CACHE_SIZE = 32;
const uint16_t AP_SAFETY_TIMEOUT_DEFAULT_S = 300;
const uint16_t AP_SAFETY_TIMEOUT_MAX_S = 3600;
const size_t SETTINGS_DOC_CAPACITY = 4096;
const char *WEB_SERIAL_PROVISION_STATE_FILE = "/.webcfg.done";
const char *WEB_SERIAL_PROVISION_PREFIX = "WEBCFG:";
const uint32_t WEB_SERIAL_PROVISION_WINDOW_MS = 10000;
const uint32_t WEB_SERIAL_PROVISION_READY_INTERVAL_MS = 300;
const size_t WEB_SERIAL_PROVISION_MAX_LINE = 4096;

String ap_name = "I2S-SD-DEFAULT";
String ap_ssid = "";
String ap_password = "12345678";
String ap_ip = "";
String ap_ip_config = "192.168.4.1";
uint8_t esp_now_channel = 6;
uint8_t device_mode = DEVICE_MODE_CURRENT;
uint8_t mesh_ttl = MESH_DEFAULT_TTL;
uint16_t ap_safety_timeout_s = AP_SAFETY_TIMEOUT_DEFAULT_S;
int16_t button_gpio13_track = 0;
int16_t button_gpio16_track = 1;
uint8_t button_gpio13_pull_mode = BUTTON_PULL_MODE_UP;
uint8_t button_gpio16_pull_mode = BUTTON_PULL_MODE_UP;
uint8_t button_gpio13_active_level = BUTTON_ACTIVE_LEVEL_LOW;
uint8_t button_gpio16_active_level = BUTTON_ACTIVE_LEVEL_LOW;
uint8_t pcf_pull_mode = PCF_PULL_MODE_UP;
uint8_t pcf_active_level = PCF_ACTIVE_LEVEL_LOW;
int16_t pcf_track_map[PCF_CHANNEL_COUNT] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15};
bool esp_now_ready = false;
bool ap_runtime_enabled = false;
bool ap_safety_ap_activated = false;
uint32_t ap_safety_activated_at_ms = 0; // when safety AP was turned on (boot window or inactivity fallback)
volatile bool restart_requested = false;
uint32_t restart_requested_at_ms = 0;
uint32_t device_id = 0;
uint32_t esp_now_message_counter = 1;
uint32_t last_esp_now_activity_ms = 0;
float usbVoltage = 0.0f;
float batteryVoltage = 0.0f;
const float USB_DIVIDER_GAIN = 2.0f;
const float BATTERY_DIVIDER_GAIN = 2.0f;
uint8_t led_mode = 0; // 0 battery, 1 rainbow, 2 off, 3 solid
uint8_t led_brightness = 10;
uint8_t led_solid_r = 0;
uint8_t led_solid_g = 0;
uint8_t led_solid_b = 64;
static bool startButtonPressed = false;
static uint32_t startButtonPressedAtMs = 0;
static bool sleepRequested = false;

typedef struct __attribute__((packed)) s_esp_now_packet
{
    uint8_t magic;
    uint8_t version;
    uint8_t cmd;
    uint8_t ttl;
    uint16_t track_index;
    uint32_t origin_id;
    uint32_t message_id;
} t_esp_now_packet;

typedef struct __attribute__((packed)) s_esp_now_packet_legacy
{
    uint8_t magic;
    uint8_t version;
    uint8_t cmd;
    uint8_t reserved;
    uint16_t track_index;
} t_esp_now_packet_legacy;

typedef struct s_mesh_seen_message
{
    uint32_t origin_id;
    uint32_t message_id;
} t_mesh_seen_message;

typedef struct s_button_state
{
    uint8_t gpio;
    bool stable_state;
    bool last_reading;
    uint32_t last_change_ms;
} t_button_state;

t_button_state button_states[2] = {
    {.gpio = BUTTON_GPIO_13, .stable_state = true, .last_reading = true, .last_change_ms = 0},
    {.gpio = BUTTON_GPIO_16, .stable_state = true, .last_reading = true, .last_change_ms = 0}};

