juthomas/I2S-ESP32-SD/src/main.cpp
volatile bool esp_now_pending_packet = false;
t_esp_now_packet esp_now_packet_to_handle = {};
volatile uint8_t esp_now_packet_format_to_handle = 0;
t_mesh_seen_message mesh_seen_messages[MESH_SEEN_CACHE_SIZE] = {};
uint8_t mesh_seen_cursor = 0;
uint16_t last_remote_played_track = 0xFFFF;
uint32_t last_remote_played_at_ms = 0;
portMUX_TYPE esp_now_mux = portMUX_INITIALIZER_UNLOCKED;
namespace patch
{
    template <typename T>
    std::string to_string(const T &n)
    {
        std::ostringstream stm;
        stm << n;
        return stm.str();
    }
}
typedef struct s_music_data
{
    String path;
    uint8_t index;
} t_music_data;

String note = "";
uint8_t volume = 60;
std::vector<t_music_data> music_data;
std::vector<String> files_list;
Audio audio;
WiFiUDP udp;
AsyncWebServer server(80);
static const uint8_t NEO_PIN = LED_IO4;
static const uint16_t NEO_COUNT = 4;
static Adafruit_NeoPixel strip(NEO_COUNT, NEO_PIN, NEO_GRB + NEO_KHZ800);
static uint16_t rainbowOffset = 0;
static uint32_t lastRainbowMs = 0;

bool is_ap_enabled_mode(uint8_t mode);
bool is_relay_mode(uint8_t mode);

String getContentType(String filename)
{
    if (filename.endsWith(".htm") || filename.endsWith(".html"))
        return "text/html";
    else if (filename.endsWith(".css"))
        return "text/css";
    else if (filename.endsWith(".js"))
        return "application/javascript";
    else if (filename.endsWith(".png"))
        return "image/png";
    else if (filename.endsWith(".jpg") || filename.endsWith(".jpeg"))
        return "image/jpeg";
    else if (filename.endsWith(".gif"))
        return "image/gif";
    else if (filename.endsWith(".ico"))
        return "image/x-icon";
    else if (filename.endsWith(".xml"))
        return "text/xml";
    else if (filename.endsWith(".pdf"))
        return "application/pdf";
    else if (filename.endsWith(".zip"))
        return "application/zip";
    else if (filename.endsWith(".gz"))
        return "application/x-gzip";
    else if (filename.endsWith(".wav"))
        return "audio/wav";
    else if (filename.endsWith(".mp3"))
        return "audio/mpeg";
    else if (filename.endsWith(".m4a"))
        return "audio/mp4";
    else if (filename.endsWith(".aac"))
        return "audio/aac";
    else if (filename.endsWith(".flac"))
        return "audio/flac";
    else if (filename.endsWith(".ogg"))
        return "audio/ogg";

    return "text/plain";
}

int8_t hex_char_to_value(char c)
{
    if (c >= '0' && c <= '9')
        return c - '0';
    if (c >= 'a' && c <= 'f')
        return 10 + (c - 'a');
    if (c >= 'A' && c <= 'F')
        return 10 + (c - 'A');
    return -1;
}

String decode_url_path(const String &encoded_path)
{
    String decoded_path = "";
    decoded_path.reserve(encoded_path.length());

    for (size_t i = 0; i < encoded_path.length(); i++)
    {
        char current_char = encoded_path.charAt(i);
        if (current_char == '%' && i + 2 < encoded_path.length())
        {
            int8_t high = hex_char_to_value(encoded_path.charAt(i + 1));
            int8_t low = hex_char_to_value(encoded_path.charAt(i + 2));
            if (high >= 0 && low >= 0)
            {
                decoded_path += (char)((high << 4) | low);
                i += 2;
                continue;
            }
        }
        decoded_path += current_char;
    }
    return decoded_path;
}

static uint32_t colorWheel(uint8_t pos)
{
    pos = 255 - pos;
    if (pos < 85)
    {
        return strip.Color(255 - pos * 3, 0, pos * 3);
    }
    if (pos < 170)
    {
        pos -= 85;
        return strip.Color(0, pos * 3, 255 - pos * 3);
    }
    pos -= 170;
    return strip.Color(pos * 3, 255 - pos * 3, 0);
}

void IRAM_ATTR onPcfInterrupt()
{
    pcfInterruptPending = true;
}

void apply_pcf_input_config()
{
    if (!pcfReady)
    {
        return;
    }
    bool pullHigh = (pcf_pull_mode == PCF_PULL_MODE_UP);
    for (uint8_t pin = 0; pin < PCF_CHANNEL_COUNT; ++pin)
    {
        PCF.write(pin, pullHigh ? HIGH : LOW);
    }

    uint16_t initValue = 0;
    for (uint8_t pin = 0; pin < PCF_CHANNEL_COUNT; ++pin)
    {
        if (PCF.read(pin))
        {
            initValue |= (1u << pin);
        }
    }
    pcfPrevValue = initValue;
}

void request_sleep()
{
    sleepRequested = true;
}

void update_hardware_power_button()
{
    bool pressed = (digitalRead((int)START_BUTTON) == LOW);
    uint32_t now = millis();
    if (pressed && !startButtonPressed)
    {
        startButtonPressed = true;
        startButtonPressedAtMs = now;
    }
    else if (!pressed && startButtonPressed)
    {
        startButtonPressed = false;
    }
    if (startButtonPressed && (uint32_t)(now - startButtonPressedAtMs) >= 2000U)
    {
        request_sleep();
        startButtonPressed = false;
    }
}

void apply_sleep_if_requested()
{
    if (!sleepRequested)
    {
        return;
    }
    sleepRequested = false;
    Serial.println("Entering deep sleep...");
    digitalWrite(I2S_ENABLE, LOW);
    strip.clear();
    strip.show();
    while (digitalRead((int)START_BUTTON) == LOW)
    {
        delay(10);
    }
    delay(50);
    esp_deep_sleep_start();
}

void update_power_measurements()
{
    uint32_t usbMv = analogReadMilliVolts(USB_VOLTAGE_PIN);
    usbVoltage = (usbMv / 1000.0f) * USB_DIVIDER_GAIN;
    uint32_t batMv = analogReadMilliVolts(BATTERY_VOLTAGE_PIN);
    if (batMv > 0)
    {
        batteryVoltage = (batMv / 1000.0f) * BATTERY_DIVIDER_GAIN;
    }
}

void update_leds(uint32_t nowMs)
{
    strip.setBrightness(led_brightness);
    if (led_mode == 2)
    {
        strip.clear();
        strip.show();
        return;
    }
    if (led_mode == 3)
    {
        uint32_t color = strip.Color(led_solid_r, led_solid_g, led_solid_b);
        for (uint16_t i = 0; i < NEO_COUNT; ++i)
        {
            strip.setPixelColor(i, color);
        }
        strip.show();
        return;
    }
    if (led_mode == 1)
    {
        if (nowMs - lastRainbowMs < 10)
        {
            return;
        }
        lastRainbowMs = nowMs;
        for (uint16_t i = 0; i < NEO_COUNT; ++i)
        {
            uint8_t wheelPos = (uint8_t)(((i * 64) / NEO_COUNT + rainbowOffset) & 0xFF);
            strip.setPixelColor(i, colorWheel(wheelPos));
        }
        strip.show();
        rainbowOffset++;
        return;
    }

    bool isCharging = (usbVoltage > 4.0f) && (digitalRead(CHRG_STATUS) == HIGH);
    float v = batteryVoltage;
    const float vMin = 3.3f;
    const float vMax = 4.2f;
    if (v < vMin)
        v = vMin;
    if (v > vMax)
        v = vMax;
    float pct = (v - vMin) / (vMax - vMin);
    int greenCount = (int)(pct * NEO_COUNT + 0.5f);
    if (greenCount < 0)
        greenCount = 0;
    if (greenCount > (int)NEO_COUNT)
        greenCount = NEO_COUNT;

    static bool blinkOn = false;
    static uint32_t lastBlinkMs = 0;
    if (isCharging && nowMs - lastBlinkMs >= 500)
    {
        lastBlinkMs = nowMs;
        blinkOn = !blinkOn;
    }
    if (!isCharging)
    {
        blinkOn = true;
    }

    const uint32_t green = strip.Color(0, 150, 0);
    const uint32_t red = strip.Color(180, 0, 0);
    const uint32_t off = strip.Color(0, 0, 0);
    for (uint16_t i = 0; i < NEO_COUNT; ++i)
    {
        if ((int)i < greenCount)
        {
            if (isCharging && (int)i == greenCount - 1 && greenCount > 0)
            {
                strip.setPixelColor(i, blinkOn ? green : off);
            }
            else
            {
                strip.setPixelColor(i, green);
            }
        }
        else
        {
            strip.setPixelColor(i, red);
        }
    }
    strip.show();
}

String local_vars_to_json()
{
    DynamicJsonDocument doc(SETTINGS_DOC_CAPACITY);

    doc["loop_file"] = loop_file;
    doc["auto_play"] = auto_play;
    doc["allow_play_over_playing"] = allow_play_over_playing;
    doc["note"] = note;
    doc["udp_port"] = localPort;
    doc["volume"] = volume;
    doc["ap_ssid"] = ap_ssid;
    doc["ap_ip"] = ap_ip;
    doc["ap_name"] = ap_name;
    doc["ap_password"] = ap_password;
    doc["ap_ip_config"] = ap_ip_config;
    doc["esp_now_channel"] = esp_now_channel;
    doc["device_mode"] = device_mode;
    doc["mesh_ttl"] = mesh_ttl;
    doc["ap_safety_timeout_s"] = ap_safety_timeout_s;
    doc["ap_runtime_enabled"] = ap_runtime_enabled;
    doc["button_gpio13_track"] = button_gpio13_track;
    doc["button_gpio14_track"] = button_gpio13_track;
    doc["button_gpio16_track"] = button_gpio16_track;
    doc["button_gpio13_pull_mode"] = button_gpio13_pull_mode;
    doc["button_gpio14_pull_mode"] = button_gpio13_pull_mode;
    doc["button_gpio16_pull_mode"] = button_gpio16_pull_mode;
    doc["button_gpio13_active_level"] = button_gpio13_active_level;
    doc["button_gpio14_active_level"] = button_gpio13_active_level;
    doc["button_gpio16_active_level"] = button_gpio16_active_level;
    doc["pcf_pull_mode"] = pcf_pull_mode;
    doc["pcf_active_level"] = pcf_active_level;
    for (uint8_t i = 0; i < PCF_CHANNEL_COUNT; i++)
    {
        doc["pcf_track_map"][i] = pcf_track_map[i];
    }
    doc["usb_voltage"] = usbVoltage;
    doc["battery_voltage"] = batteryVoltage;
    doc["charge_status"] = digitalRead(CHRG_STATUS) == HIGH;
    doc["led_mode"] = led_mode;
    doc["led_brightness"] = led_brightness;
    doc["led_solid_r"] = led_solid_r;
    doc["led_solid_g"] = led_solid_g;
    doc["led_solid_b"] = led_solid_b;
    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        doc["track_assignation"][i]["path"] = music_data[i].path;
        doc["track_assignation"][i]["index"] = music_data[i].index;
    }
    String buff;
    serializeJsonPretty(doc, buff);
    return (buff);
}

void update_spiffs()
{
    const char *filePath = "/data.json";
    fs::File file = SPIFFS.open(filePath, "w");
    file.print(local_vars_to_json().c_str());
    file.close();
}

