juthomas/I2S-ESP32-SD/src/main.cpp
void json_to_local_vars(const uint8_t *data, size_t data_len)
{
    DynamicJsonDocument doc(SETTINGS_DOC_CAPACITY);

    DeserializationError error = deserializeJson(doc, data, data_len);
    if (error)
    {
        Serial.println(error.c_str());
        return;
    }

    if (doc.containsKey("loop_file"))
    {
        bool tmp_loop_file = doc["loop_file"].as<const bool>();
        if (tmp_loop_file != loop_file)
        {
            loop_file = tmp_loop_file;
            audio.setFileLoop(loop_file);
        }
    }
    if (doc.containsKey("auto_play"))
        auto_play = doc["auto_play"].as<const bool>();
    if (doc.containsKey("allow_play_over_playing"))
        allow_play_over_playing = doc["allow_play_over_playing"].as<const bool>();
    if (doc.containsKey("note"))
        note = doc["note"].as<String>();
    if (doc.containsKey("udp_port"))
        localPort = doc["udp_port"].as<unsigned int>();
    if (doc.containsKey("volume"))
    {
        uint8_t tmp_volume = doc["volume"].as<unsigned char>();
        if (tmp_volume != volume)
        {
            volume = tmp_volume;
            audio.setVolume(volume);
        }
    }
    if (doc.containsKey("button_gpio13_track"))
    {
        int16_t tmp_track = doc["button_gpio13_track"].as<int>();
        button_gpio13_track = tmp_track < -1 ? -1 : tmp_track;
    }
    else if (doc.containsKey("button_gpio14_track"))
    {
        int16_t tmp_track = doc["button_gpio14_track"].as<int>();
        button_gpio13_track = tmp_track < -1 ? -1 : tmp_track;
    }
    if (doc.containsKey("button_gpio16_track"))
    {
        int16_t tmp_track = doc["button_gpio16_track"].as<int>();
        button_gpio16_track = tmp_track < -1 ? -1 : tmp_track;
    }
    if (doc.containsKey("button_gpio13_pull_mode"))
    {
        button_gpio13_pull_mode = doc["button_gpio13_pull_mode"].as<unsigned int>();
    }
    else if (doc.containsKey("button_gpio14_pull_mode"))
    {
        button_gpio13_pull_mode = doc["button_gpio14_pull_mode"].as<unsigned int>();
    }
    if (doc.containsKey("button_gpio16_pull_mode"))
    {
        button_gpio16_pull_mode = doc["button_gpio16_pull_mode"].as<unsigned int>();
    }
    if (doc.containsKey("button_gpio13_active_level"))
    {
        button_gpio13_active_level = doc["button_gpio13_active_level"].as<unsigned int>();
    }
    else if (doc.containsKey("button_gpio14_active_level"))
    {
        button_gpio13_active_level = doc["button_gpio14_active_level"].as<unsigned int>();
    }
    if (doc.containsKey("button_gpio16_active_level"))
    {
        button_gpio16_active_level = doc["button_gpio16_active_level"].as<unsigned int>();
    }
    if (doc.containsKey("pcf_pull_mode"))
    {
        pcf_pull_mode = doc["pcf_pull_mode"].as<unsigned int>();
    }
    if (doc.containsKey("pcf_active_level"))
    {
        pcf_active_level = doc["pcf_active_level"].as<unsigned int>();
    }
    if (doc.containsKey("pcf_track_map"))
    {
        JsonArray pcfMap = doc["pcf_track_map"].as<JsonArray>();
        for (uint8_t i = 0; i < PCF_CHANNEL_COUNT; i++)
        {
            if (i < pcfMap.size())
            {
                pcf_track_map[i] = pcfMap[i].as<int>();
            }
        }
    }
    if (doc.containsKey("led_mode"))
    {
        led_mode = doc["led_mode"].as<unsigned int>();
    }
    if (doc.containsKey("led_brightness"))
    {
        led_brightness = doc["led_brightness"].as<unsigned int>();
    }
    if (doc.containsKey("led_solid_r"))
    {
        led_solid_r = doc["led_solid_r"].as<unsigned int>();
    }
    if (doc.containsKey("led_solid_g"))
    {
        led_solid_g = doc["led_solid_g"].as<unsigned int>();
    }
    if (doc.containsKey("led_solid_b"))
    {
        led_solid_b = doc["led_solid_b"].as<unsigned int>();
    }
    if (doc.containsKey("ap_ssid"))
        ap_ssid = doc["ap_ssid"].as<String>();
    else if (doc.containsKey("ssid"))
        ap_ssid = doc["ssid"].as<String>();
    if (doc.containsKey("ap_name"))
        ap_name = doc["ap_name"].as<String>();
    if (doc.containsKey("ap_password"))
        ap_password = doc["ap_password"].as<String>();
    if (doc.containsKey("ap_ip_config"))
        ap_ip_config = doc["ap_ip_config"].as<String>();
    else if (doc.containsKey("ap_ip"))
        ap_ip_config = doc["ap_ip"].as<String>();
    if (doc.containsKey("esp_now_channel"))
    {
        uint8_t tmp_channel = doc["esp_now_channel"].as<unsigned int>();
        if (tmp_channel >= 1 && tmp_channel <= 13)
            esp_now_channel = tmp_channel;
    }
    if (doc.containsKey("device_mode"))
    {
        uint8_t tmp_mode = doc["device_mode"].as<unsigned int>();
        if (tmp_mode <= DEVICE_MODE_RELAY_ONLY)
            device_mode = tmp_mode;
    }
    if (doc.containsKey("mesh_ttl"))
    {
        uint8_t tmp_ttl = doc["mesh_ttl"].as<unsigned int>();
        if (tmp_ttl >= 1 && tmp_ttl <= MESH_MAX_TTL)
            mesh_ttl = tmp_ttl;
    }
    if (doc.containsKey("ap_safety_timeout_s"))
    {
        int32_t tmp_timeout = doc["ap_safety_timeout_s"].as<int>();
        if (tmp_timeout >= 0 && tmp_timeout <= AP_SAFETY_TIMEOUT_MAX_S)
            ap_safety_timeout_s = (uint16_t)tmp_timeout;
    }
    if (doc.containsKey("track_assignation"))
    {
        music_data.clear();
        for (uint16_t i = 0; i < doc["track_assignation"].size(); i++)
        {
            music_data.push_back((t_music_data){.path = doc["track_assignation"][i]["path"].as<String>(),
                                                .index = (uint8_t)i});
        }
    }
}

void load_spiffs()
{
    const char *filePath = "/data.json";
    fs::File file = SPIFFS.open(filePath, "r");
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        return;
    }
    Serial.printf("File Size : %d\n", file.size());
    Serial.printf("Free Heap : %d\n", ESP.getFreeHeap());
    uint8_t *buff;
    size_t read_index = 1;
    size_t buff_size = file.size();
    buff = (uint8_t *)malloc(sizeof(char) * (buff_size + 1));
    if ((read_index = file.read(buff, (buff_size))) > 0)
    {
        buff[read_index] = '\0';
        Serial.printf("[SPIFFS]\n%s", buff);
    }
    else
    {
        Serial.printf("Error reading SPIFFS");
    }

    json_to_local_vars(buff, read_index);

    free(buff);
    file.close();

    Serial.printf("SPIFFS loop_file : %s\n", loop_file ? "true" : "false");
    Serial.printf("SPIFFS auto_play : %s\n", auto_play ? "true" : "false");
    Serial.printf("SPIFFS allow_play_over_playing : %s\n", allow_play_over_playing ? "true" : "false");
    Serial.printf("SPIFFS note : %s\n", note.c_str());
    Serial.printf("SPIFFS udp_port : %d\n", localPort);
    Serial.printf("SPIFFS volume : %d\n", volume);
    Serial.printf("SPIFFS ap_ssid : %s\n", ap_ssid.c_str());
    Serial.printf("SPIFFS ap_name : %s\n", ap_name.c_str());
    Serial.printf("SPIFFS ap_ip_config : %s\n", ap_ip_config.c_str());
    Serial.printf("SPIFFS esp_now_channel : %u\n", esp_now_channel);
    Serial.printf("SPIFFS device_mode : %u\n", device_mode);
    Serial.printf("SPIFFS mesh_ttl : %u\n", mesh_ttl);
    Serial.printf("SPIFFS ap_safety_timeout_s : %u\n", ap_safety_timeout_s);
    Serial.printf("SPIFFS button_gpio13_track : %d\n", button_gpio13_track);
    Serial.printf("SPIFFS button_gpio16_track : %d\n", button_gpio16_track);
    Serial.printf("SPIFFS button_gpio13_pull_mode : %u\n", button_gpio13_pull_mode);
    Serial.printf("SPIFFS button_gpio16_pull_mode : %u\n", button_gpio16_pull_mode);
    Serial.printf("SPIFFS button_gpio13_active_level : %u\n", button_gpio13_active_level);
    Serial.printf("SPIFFS button_gpio16_active_level : %u\n", button_gpio16_active_level);
    Serial.printf("SPIFFS pcf_pull_mode : %u\n", pcf_pull_mode);
    Serial.printf("SPIFFS pcf_active_level : %u\n", pcf_active_level);

    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        Serial.printf("SPIFFS track_assignation (path:'%s' index:%d)\n", music_data[i].path.c_str(), music_data[i].index);
    }
}

