juthomas/I2S-ESP32-SD/src/main.cpp
void load_json_config_on_sd(const char *filename)
{
    File jsonFile = SD.open(filename, FILE_READ);
    if (!jsonFile)
    {
        Serial.println("Json Config file not found on SD card !");
        return;
    }

    String jsonContent;
    while (jsonFile.available())
    {
        jsonContent += char(jsonFile.read());
    }
    jsonFile.close();

    StaticJsonDocument<2048> doc;

    DeserializationError error = deserializeJson(doc, jsonContent);
    if (error)
    {
        Serial.println(error.c_str());
        return;
    }
    if (doc.containsKey("ap_ssid"))
    {
        ap_ssid = doc["ap_ssid"].as<String>();
        Serial.print("ap_ssid on sd card :");
        Serial.println(ap_ssid);
    }
    else if (doc.containsKey("ssid"))
    {
        ap_ssid = doc["ssid"].as<String>();
        Serial.print("legacy ssid reused as ap_ssid :");
        Serial.println(ap_ssid);
    }
    if (doc.containsKey("ap_name"))
    {
        ap_name = doc["ap_name"].as<String>();
        Serial.print("ap_name on sd card :");
        Serial.println(ap_name);
    }
    if (doc.containsKey("ap_password"))
    {
        ap_password = doc["ap_password"].as<String>();
        Serial.print("ap_password on sd card :");
        Serial.println(ap_password);
    }
    else if (doc.containsKey("password"))
    {
        ap_password = doc["password"].as<String>();
        Serial.print("legacy password reused as ap_password :");
        Serial.println(ap_password);
    }
    if (doc.containsKey("ap_ip_config"))
    {
        ap_ip_config = doc["ap_ip_config"].as<String>();
        Serial.print("ap_ip_config on sd card :");
        Serial.println(ap_ip_config);
    }
    else if (doc.containsKey("ap_ip"))
    {
        ap_ip_config = doc["ap_ip"].as<String>();
        Serial.print("legacy ap_ip reused as ap_ip_config :");
        Serial.println(ap_ip_config);
    }
    if (doc.containsKey("esp_now_channel"))
    {
        uint8_t tmp_channel = doc["esp_now_channel"].as<unsigned int>();
        if (tmp_channel >= 1 && tmp_channel <= 13)
        {
            esp_now_channel = tmp_channel;
            Serial.print("esp_now_channel on sd card :");
            Serial.println(esp_now_channel);
        }
    }
    if (doc.containsKey("device_mode"))
    {
        uint8_t tmp_mode = doc["device_mode"].as<unsigned int>();
        if (tmp_mode <= DEVICE_MODE_RELAY_ONLY)
        {
            device_mode = tmp_mode;
            Serial.print("device_mode on sd card :");
            Serial.println(device_mode);
        }
    }
    if (doc.containsKey("mesh_ttl"))
    {
        uint8_t tmp_ttl = doc["mesh_ttl"].as<unsigned int>();
        if (tmp_ttl >= 1 && tmp_ttl <= MESH_MAX_TTL)
        {
            mesh_ttl = tmp_ttl;
            Serial.print("mesh_ttl on sd card :");
            Serial.println(mesh_ttl);
        }
    }
    if (doc.containsKey("ap_safety_timeout_s"))
    {
        int32_t tmp_timeout = doc["ap_safety_timeout_s"].as<int>();
        if (tmp_timeout >= 0 && tmp_timeout <= AP_SAFETY_TIMEOUT_MAX_S)
        {
            ap_safety_timeout_s = (uint16_t)tmp_timeout;
            Serial.print("ap_safety_timeout_s on sd card :");
            Serial.println(ap_safety_timeout_s);
        }
    }
    if (doc.containsKey("allow_play_over_playing"))
    {
        allow_play_over_playing = doc["allow_play_over_playing"].as<const bool>();
        Serial.print("allow_play_over_playing on sd card :");
        Serial.println(allow_play_over_playing ? "true" : "false");
    }
    if (doc.containsKey("button_gpio13_track"))
    {
        button_gpio13_track = doc["button_gpio13_track"].as<int>();
        Serial.print("button_gpio13_track on sd card :");
        Serial.println(button_gpio13_track);
    }
    else if (doc.containsKey("button_gpio14_track"))
    {
        button_gpio13_track = doc["button_gpio14_track"].as<int>();
        Serial.print("button_gpio14_track on sd card :");
        Serial.println(button_gpio13_track);
    }
    if (doc.containsKey("button_gpio16_track"))
    {
        button_gpio16_track = doc["button_gpio16_track"].as<int>();
        Serial.print("button_gpio16_track on sd card :");
        Serial.println(button_gpio16_track);
    }
    if (doc.containsKey("button_gpio13_pull_mode"))
    {
        button_gpio13_pull_mode = doc["button_gpio13_pull_mode"].as<unsigned int>();
        Serial.print("button_gpio13_pull_mode on sd card :");
        Serial.println(button_gpio13_pull_mode);
    }
    else if (doc.containsKey("button_gpio14_pull_mode"))
    {
        button_gpio13_pull_mode = doc["button_gpio14_pull_mode"].as<unsigned int>();
        Serial.print("button_gpio14_pull_mode on sd card :");
        Serial.println(button_gpio13_pull_mode);
    }
    if (doc.containsKey("button_gpio16_pull_mode"))
    {
        button_gpio16_pull_mode = doc["button_gpio16_pull_mode"].as<unsigned int>();
        Serial.print("button_gpio16_pull_mode on sd card :");
        Serial.println(button_gpio16_pull_mode);
    }
    if (doc.containsKey("button_gpio13_active_level"))
    {
        button_gpio13_active_level = doc["button_gpio13_active_level"].as<unsigned int>();
        Serial.print("button_gpio13_active_level on sd card :");
        Serial.println(button_gpio13_active_level);
    }
    else if (doc.containsKey("button_gpio14_active_level"))
    {
        button_gpio13_active_level = doc["button_gpio14_active_level"].as<unsigned int>();
        Serial.print("button_gpio14_active_level on sd card :");
        Serial.println(button_gpio13_active_level);
    }
    if (doc.containsKey("button_gpio16_active_level"))
    {
        button_gpio16_active_level = doc["button_gpio16_active_level"].as<unsigned int>();
        Serial.print("button_gpio16_active_level on sd card :");
        Serial.println(button_gpio16_active_level);
    }
    if (doc.containsKey("pcf_pull_mode"))
    {
        pcf_pull_mode = doc["pcf_pull_mode"].as<unsigned int>();
        Serial.print("pcf_pull_mode on sd card :");
        Serial.println(pcf_pull_mode);
    }
    if (doc.containsKey("pcf_active_level"))
    {
        pcf_active_level = doc["pcf_active_level"].as<unsigned int>();
        Serial.print("pcf_active_level on sd card :");
        Serial.println(pcf_active_level);
    }
    if (doc.containsKey("pcf_track_map"))
    {
        JsonArray pcfMap = doc["pcf_track_map"].as<JsonArray>();
        for (uint8_t i = 0; i < PCF_CHANNEL_COUNT; i++)
        {
            if (i < pcfMap.size())
            {
                pcf_track_map[i] = pcfMap[i].as<int>();
            }
        }
        Serial.println("pcf_track_map loaded from sd card");
    }
}

