juthomas/I2S-ESP32-SD/src/main.cpp
std::vector<String> listSdFiles(const char *dirname)
{
    std::vector<String> fileList;

    // Ouvrir le répertoire spécifié
    File root = SD.open(dirname);

    // Vérifier si le répertoire a pu être ouvert
    if (!root)
    {
        Serial.println("Erreur lors de l'ouverture du répertoire !");
        return fileList;
    }

    // Parcourir tous les fichiers du répertoire
    while (true)
    {
        File entry = root.openNextFile();

        // Arrêter la boucle lorsque tous les fichiers ont été listés
        if (!entry)
        {
            break;
        }
        String nameString = String(entry.name());
        nameString.toLowerCase();
        if (!nameString.startsWith("/.") && (nameString.endsWith(".wav") || nameString.endsWith(".mp3")))
        {
            // Afficher le nom du fichier
            Serial.println(entry.name());
            fileList.push_back(String(entry.name()));
        }
        // Fermer le fichier
        entry.close();
    }

    // Fermer le répertoire
    root.close();

    // Trier la liste des fichiers dans l'ordre alphabétique
    std::sort(fileList.begin(), fileList.end());

    return fileList;
}

void update_music_from_sd()
{
    files_list = listSdFiles("/");
    std::vector<t_music_data> previous_order = music_data;
    music_data.clear();

    for (std::vector<t_music_data>::size_type i = 0; i != previous_order.size(); i++)
    {
        const String &candidate = previous_order[i].path;
        if (std::find(files_list.begin(), files_list.end(), candidate) != files_list.end())
        {
            bool already_added = false;
            for (std::vector<t_music_data>::size_type j = 0; j != music_data.size(); j++)
            {
                if (music_data[j].path == candidate)
                {
                    already_added = true;
                    break;
                }
            }
            if (!already_added)
            {
                music_data.push_back((t_music_data){.path = candidate, .index = 0});
            }
        }
    }

    for (std::vector<String>::size_type i = 0; i != files_list.size(); i++)
    {
        bool already_added = false;
        for (std::vector<t_music_data>::size_type j = 0; j != music_data.size(); j++)
        {
            if (music_data[j].path == files_list[i])
            {
                already_added = true;
                break;
            }
        }
        if (!already_added)
        {
            music_data.push_back((t_music_data){.path = files_list[i], .index = 0});
        }
    }

    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        music_data[i].index = (uint8_t)i;
    }
}

void apply_reordered_paths(const std::vector<String> &ordered_paths)
{
    if (ordered_paths.size() == 0 || music_data.size() == 0)
        return;

    std::vector<t_music_data> reordered;
    reordered.reserve(music_data.size());

    for (std::vector<String>::size_type i = 0; i != ordered_paths.size(); i++)
    {
        for (std::vector<t_music_data>::size_type j = 0; j != music_data.size(); j++)
        {
            if (music_data[j].path == ordered_paths[i])
            {
                bool already_added = false;
                for (std::vector<t_music_data>::size_type k = 0; k != reordered.size(); k++)
                {
                    if (reordered[k].path == music_data[j].path)
                    {
                        already_added = true;
                        break;
                    }
                }
                if (!already_added)
                {
                    reordered.push_back((t_music_data){.path = music_data[j].path, .index = 0});
                }
            }
        }
    }

    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        bool already_added = false;
        for (std::vector<t_music_data>::size_type j = 0; j != reordered.size(); j++)
        {
            if (reordered[j].path == music_data[i].path)
            {
                already_added = true;
                break;
            }
        }
        if (!already_added)
        {
            reordered.push_back((t_music_data){.path = music_data[i].path, .index = 0});
        }
    }

    music_data = reordered;
    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        music_data[i].index = (uint8_t)i;
    }
}

String build_ap_ssid()
{
    String prefix = ap_name;
    prefix.trim();
    if (prefix.length() == 0)
        prefix = "I2S-SD-DEFAULT";
    if (prefix.length() > 31)
        prefix = prefix.substring(0, 31);
    return prefix;
}

String resolve_ap_ssid()
{
    String configured_ssid = ap_ssid;
    configured_ssid.trim();
    if (configured_ssid.length() > 31)
        configured_ssid = configured_ssid.substring(0, 31);
    if (configured_ssid.length() > 0)
        return configured_ssid;
    return build_ap_ssid();
}

void mark_esp_now_activity()
{
    last_esp_now_activity_ms = millis();
}

bool parse_ipv4_string(const String &ip_value, IPAddress &parsed_ip)
{
    int octet1 = 0;
    int octet2 = 0;
    int octet3 = 0;
    int octet4 = 0;
    if (sscanf(ip_value.c_str(), "%d.%d.%d.%d", &octet1, &octet2, &octet3, &octet4) != 4)
    {
        return false;
    }
    if (octet1 < 0 || octet1 > 255 || octet2 < 0 || octet2 > 255 || octet3 < 0 || octet3 > 255 || octet4 < 0 || octet4 > 255)
    {
        return false;
    }
    parsed_ip = IPAddress((uint8_t)octet1, (uint8_t)octet2, (uint8_t)octet3, (uint8_t)octet4);
    return true;
}

bool is_ap_enabled_mode(uint8_t mode)
{
    return mode == DEVICE_MODE_CURRENT || mode == DEVICE_MODE_MESH;
}

bool is_mesh_mode(uint8_t mode)
{
    return mode == DEVICE_MODE_MESH;
}

bool is_relay_mode(uint8_t mode)
{
    return mode == DEVICE_MODE_MESH || mode == DEVICE_MODE_RELAY_ONLY;
}

bool start_soft_ap_runtime()
{
    IPAddress configured_ap_ip;
    parse_ipv4_string(ap_ip_config, configured_ap_ip);
    IPAddress ap_subnet(255, 255, 255, 0);

    WiFi.mode(WIFI_AP_STA);
    WiFi.setSleep(false);
    if (!WiFi.softAPConfig(configured_ap_ip, configured_ap_ip, ap_subnet))
    {
        Serial.println("AP IP config failed, continuing with defaults");
    }

