juthomas/I2S-ESP32-SD/src/main.cpp
    ap_ssid = resolve_ap_ssid();
    bool ap_started = WiFi.softAP(ap_ssid.c_str(), ap_password.c_str(), esp_now_channel, false, 4);
    if (!ap_started)
    {
        Serial.println("AP initialization failed!");
        ap_runtime_enabled = false;
        return false;
    }
    ap_ip = WiFi.softAPIP().toString();
    ap_runtime_enabled = true;
    return true;
}

uint32_t generate_esp_now_message_id()
{
    uint32_t next_id = esp_now_message_counter++;
    if (next_id == 0)
    {
        next_id = esp_now_message_counter++;
    }
    return next_id;
}

bool has_seen_mesh_message(uint32_t origin_id, uint32_t message_id)
{
    for (uint8_t i = 0; i < MESH_SEEN_CACHE_SIZE; i++)
    {
        if (mesh_seen_messages[i].origin_id == origin_id && mesh_seen_messages[i].message_id == message_id)
        {
            return true;
        }
    }
    return false;
}

void remember_mesh_message(uint32_t origin_id, uint32_t message_id)
{
    mesh_seen_messages[mesh_seen_cursor] = (t_mesh_seen_message){.origin_id = origin_id, .message_id = message_id};
    mesh_seen_cursor = (mesh_seen_cursor + 1) % MESH_SEEN_CACHE_SIZE;
}

void sanitize_network_settings()
{
    ap_ssid.trim();
    if (ap_ssid.length() > 31)
    {
        ap_ssid = ap_ssid.substring(0, 31);
    }

    ap_name.trim();
    if (ap_name.length() == 0)
    {
        ap_name = "I2S-SD-DEFAULT";
    }

    if (device_mode > DEVICE_MODE_RELAY_ONLY)
    {
        device_mode = DEVICE_MODE_CURRENT;
    }

    if (mesh_ttl < 1 || mesh_ttl > MESH_MAX_TTL)
    {
        mesh_ttl = MESH_DEFAULT_TTL;
    }
    if (button_gpio13_track < -1)
    {
        button_gpio13_track = -1;
    }
    if (button_gpio16_track < -1)
    {
        button_gpio16_track = -1;
    }
    if (button_gpio13_pull_mode > BUTTON_PULL_MODE_NONE)
    {
        button_gpio13_pull_mode = BUTTON_PULL_MODE_UP;
    }
    if (button_gpio16_pull_mode > BUTTON_PULL_MODE_NONE)
    {
        button_gpio16_pull_mode = BUTTON_PULL_MODE_UP;
    }
    if (button_gpio13_active_level > BUTTON_ACTIVE_LEVEL_HIGH)
    {
        button_gpio13_active_level = BUTTON_ACTIVE_LEVEL_LOW;
    }
    if (button_gpio16_active_level > BUTTON_ACTIVE_LEVEL_HIGH)
    {
        button_gpio16_active_level = BUTTON_ACTIVE_LEVEL_LOW;
    }
    if (pcf_pull_mode > PCF_PULL_MODE_DOWN)
    {
        pcf_pull_mode = PCF_PULL_MODE_UP;
    }
    if (pcf_active_level > PCF_ACTIVE_LEVEL_HIGH)
    {
        pcf_active_level = PCF_ACTIVE_LEVEL_LOW;
    }
    for (uint8_t i = 0; i < PCF_CHANNEL_COUNT; i++)
    {
        if (pcf_track_map[i] < -1)
        {
            pcf_track_map[i] = -1;
        }
    }
    if (led_mode > 3)
    {
        led_mode = 0;
    }

    ap_password.trim();
    if (ap_password.length() < 8)
    {
        Serial.println("AP password too short, fallback to 12345678");
        ap_password = "12345678";
    }
    if (ap_password.length() > 63)
    {
        ap_password = ap_password.substring(0, 63);
    }

    if (esp_now_channel < 1 || esp_now_channel > 13)
    {
        esp_now_channel = 6;
    }
    if (ap_safety_timeout_s > AP_SAFETY_TIMEOUT_MAX_S)
    {
        ap_safety_timeout_s = AP_SAFETY_TIMEOUT_MAX_S;
    }

    IPAddress parsed_ip;
    if (!parse_ipv4_string(ap_ip_config, parsed_ip))
    {
        Serial.println("Invalid AP IP, fallback to 192.168.4.1");
        ap_ip_config = "192.168.4.1";
    }
}

void schedule_restart(uint32_t delay_ms)
{
    restart_requested = true;
    restart_requested_at_ms = millis() + delay_ms;
}

void handle_pending_restart()
{
    if (!restart_requested)
    {
        return;
    }
    if ((int32_t)(millis() - restart_requested_at_ms) >= 0)
    {
        Serial.println("Applying network changes, restarting...");
        delay(100);
        ESP.restart();
    }
}

void handle_ap_off_safety_timeout()
{
    // If safety AP is on, turn it off after the configured duration (e.g. 5 min boot window)
    if (ap_safety_ap_activated && ap_safety_activated_at_ms != 0)
    {
        uint32_t elapsed_ms = (uint32_t)(millis() - ap_safety_activated_at_ms);
        if (elapsed_ms >= (uint32_t)ap_safety_timeout_s * 1000UL)
        {
            Serial.printf("AP safety window ended (%us), disabling AP\n", ap_safety_timeout_s);
            WiFi.softAPdisconnect(false);
            ap_safety_ap_activated = false;
            ap_runtime_enabled = false;
            ap_ip = "";
            WiFi.mode(WIFI_STA);
            WiFi.setSleep(false);
            esp_err_t channel_result = esp_wifi_set_channel(esp_now_channel, WIFI_SECOND_CHAN_NONE);
            if (channel_result != ESP_OK)
            {
                Serial.printf("Failed to set ESP-NOW channel: %d\n", channel_result);
            }
            return;
        }
        return;
    }

    if (!esp_now_ready || is_ap_enabled_mode(device_mode) || ap_runtime_enabled || ap_safety_ap_activated)
    {
        return;
    }
    if (ap_safety_timeout_s == 0)
    {
        return;
    }
    uint32_t timeout_ms = (uint32_t)ap_safety_timeout_s * 1000UL;
    if ((uint32_t)(millis() - last_esp_now_activity_ms) < timeout_ms)
    {
        return;
    }

    Serial.printf("ESP-NOW safety timeout reached (%us), enabling AP fallback\n", ap_safety_timeout_s);
    if (start_soft_ap_runtime())
    {
        ap_safety_ap_activated = true;
        ap_safety_activated_at_ms = millis();
        update_spiffs();
    }
}

bool play_track_by_index(uint16_t audio_to_play)
{
    if (!allow_play_over_playing && audio.isRunning())
    {
        Serial.println("Play ignored: a track is already playing (allow_play_over_playing is false)");
        return false;
    }
    if (music_data.size() > audio_to_play)
    {
        String target_path = music_data[audio_to_play].path;
        if (!SD.exists(target_path))
        {
            update_music_from_sd();
            if (music_data.size() <= audio_to_play)
            {
                Serial.printf("Sound number %d is out of range\n", audio_to_play);
                return false;
            }
            target_path = music_data[audio_to_play].path;
        }

        Serial.printf("Playing : %s\n", target_path.c_str());
        audio.connecttoFS(SD, target_path.c_str());
        if (loop_file)
        {
            audio.setFileLoop(true);
        }
        return true;
    }
    Serial.printf("Sound number %d is out of range\n", audio_to_play);
    return false;
}

bool should_skip_remote_duplicate_play(uint16_t track_index)
{
    uint32_t now = millis();
    if (last_remote_played_track == track_index &&
        (uint32_t)(now - last_remote_played_at_ms) < REMOTE_PLAYBACK_DEDUP_WINDOW_MS)
    {
        return true;
    }
    last_remote_played_track = track_index;
    last_remote_played_at_ms = now;
    return false;
}

