juthomas/I2S-ESP32-SD/src/main.cpp
int16_t get_track_for_button(uint8_t gpio)
{
    if (gpio == BUTTON_GPIO_13)
        return button_gpio13_track;
    if (gpio == BUTTON_GPIO_16)
        return button_gpio16_track;
    return -1;
}

uint8_t get_pull_mode_for_button(uint8_t gpio)
{
    if (gpio == BUTTON_GPIO_13)
        return button_gpio13_pull_mode;
    if (gpio == BUTTON_GPIO_16)
        return button_gpio16_pull_mode;
    return BUTTON_PULL_MODE_UP;
}

uint8_t get_active_level_for_button(uint8_t gpio)
{
    if (gpio == BUTTON_GPIO_13)
        return button_gpio13_active_level;
    if (gpio == BUTTON_GPIO_16)
        return button_gpio16_active_level;
    return BUTTON_ACTIVE_LEVEL_LOW;
}

bool is_button_active_level(uint8_t gpio, bool level)
{
    uint8_t active_level = get_active_level_for_button(gpio);
    if (active_level == BUTTON_ACTIVE_LEVEL_HIGH)
        return level == HIGH;
    return level == LOW;
}

void apply_button_input_config()
{
    for (uint8_t i = 0; i < 2; i++)
    {
        t_button_state &button = button_states[i];
        uint8_t pull_mode = get_pull_mode_for_button(button.gpio);
        if (pull_mode == BUTTON_PULL_MODE_DOWN)
            pinMode(button.gpio, INPUT_PULLDOWN);
        else if (pull_mode == BUTTON_PULL_MODE_NONE)
            pinMode(button.gpio, INPUT);
        else
            pinMode(button.gpio, INPUT_PULLUP);

        bool reading = digitalRead(button.gpio);
        button.stable_state = reading;
        button.last_reading = reading;
        button.last_change_ms = millis();
    }
}

void on_esp_now_receive(const uint8_t *mac_addr, const uint8_t *incoming_data, int len)
{
    (void)mac_addr;
    t_esp_now_packet packet = {};
    uint8_t packet_format = 0;

    if (len == (int)sizeof(t_esp_now_packet))
    {
        t_esp_now_packet candidate = {};
        memcpy(&candidate, incoming_data, sizeof(candidate));
        if (candidate.magic != ESP_NOW_PACKET_MAGIC || candidate.version != ESP_NOW_PACKET_VERSION || candidate.cmd != ESP_NOW_CMD_PLAY_TRACK)
            return;
        packet = candidate;
        packet_format = ESP_NOW_PACKET_VERSION;
    }
    else if (len == (int)sizeof(t_esp_now_packet_legacy))
    {
        t_esp_now_packet_legacy legacy = {};
        memcpy(&legacy, incoming_data, sizeof(legacy));
        if (legacy.magic != ESP_NOW_PACKET_MAGIC || legacy.version != ESP_NOW_PACKET_VERSION_LEGACY || legacy.cmd != ESP_NOW_CMD_PLAY_TRACK)
            return;
        packet = (t_esp_now_packet){
            .magic = legacy.magic,
            .version = legacy.version,
            .cmd = legacy.cmd,
            .ttl = 0,
            .track_index = legacy.track_index,
            .origin_id = 0,
            .message_id = 0};
        packet_format = ESP_NOW_PACKET_VERSION_LEGACY;
    }
    else
    {
        return;
    }

    portENTER_CRITICAL_ISR(&esp_now_mux);
    esp_now_packet_to_handle = packet;
    esp_now_packet_format_to_handle = packet_format;
    esp_now_pending_packet = true;
    portEXIT_CRITICAL_ISR(&esp_now_mux);
}

bool init_esp_now()
{
    esp_now_ready = false;

    if (esp_now_init() != ESP_OK)
    {
        Serial.println("Error initializing ESP-NOW");
        return false;
    }
    esp_now_register_recv_cb(on_esp_now_receive);

    esp_now_peer_info_t peer_info = {};
    memcpy(peer_info.peer_addr, ESP_NOW_BROADCAST_ADDR, sizeof(ESP_NOW_BROADCAST_ADDR));
    peer_info.channel = esp_now_channel;
    peer_info.encrypt = false;

    esp_err_t add_peer_result = esp_now_add_peer(&peer_info);
    if (add_peer_result != ESP_OK && add_peer_result != ESP_ERR_ESPNOW_EXIST)
    {
        Serial.printf("ESP-NOW add peer error: %d\n", add_peer_result);
        return false;
    }
    for (uint8_t i = 0; i < MESH_SEEN_CACHE_SIZE; i++)
    {
        mesh_seen_messages[i] = (t_mesh_seen_message){.origin_id = 0, .message_id = 0};
    }
    mesh_seen_cursor = 0;
    esp_now_ready = true;
    Serial.println("ESP-NOW initialized");
    return true;
}

void send_esp_now_packet(const uint8_t *packet_data, size_t packet_len)
{
    if (!esp_now_ready)
        return;

    esp_err_t send_result = esp_now_send(ESP_NOW_BROADCAST_ADDR, packet_data, packet_len);
    if (send_result != ESP_OK)
    {
        Serial.printf("ESP-NOW send failed: %d\n", send_result);
    }
    else
    {
        mark_esp_now_activity();
    }
}

void send_esp_now_play_track_legacy(uint16_t track_index)
{
    t_esp_now_packet_legacy packet = {
        .magic = ESP_NOW_PACKET_MAGIC,
        .version = ESP_NOW_PACKET_VERSION_LEGACY,
        .cmd = ESP_NOW_CMD_PLAY_TRACK,
        .reserved = 0,
        .track_index = track_index};
    send_esp_now_packet((const uint8_t *)&packet, sizeof(packet));
}

void send_esp_now_play_track(uint16_t track_index)
{
    // Compatibility path: keep current mode interoperable with legacy firmware.
    if (!is_relay_mode(device_mode))
    {
        send_esp_now_play_track_legacy(track_index);
        return;
    }

    t_esp_now_packet packet = {
        .magic = ESP_NOW_PACKET_MAGIC,
        .version = ESP_NOW_PACKET_VERSION,
        .cmd = ESP_NOW_CMD_PLAY_TRACK,
        .ttl = (uint8_t)(is_relay_mode(device_mode) ? mesh_ttl : 0),
        .track_index = track_index,
        .origin_id = device_id,
        .message_id = generate_esp_now_message_id()};

    remember_mesh_message(packet.origin_id, packet.message_id);
    send_esp_now_packet((const uint8_t *)&packet, sizeof(packet));
    // Also send legacy packet so mixed fleets can still play in relay mode.
    send_esp_now_play_track_legacy(track_index);
}

void handle_button_pressed(uint8_t gpio)
{
    int16_t configured_track = get_track_for_button(gpio);
    if (configured_track < 0)
    {
        Serial.printf("GPIO %u: no track assigned\n", gpio);
        return;
    }
    Serial.printf("GPIO %u pressed, track %d\n", gpio, configured_track);
    if (play_track_by_index((uint16_t)configured_track))
    {
        send_esp_now_play_track((uint16_t)configured_track);
    }
}

void handle_pcf_pending_interrupt()
{
    if (!pcfReady || !pcfInterruptPending)
    {
        return;
    }
    pcfInterruptPending = false;

