juthomas/I2S-ESP32-SD/src/main.cpp
    uint16_t pcfValue = 0;
    for (uint8_t pin = 0; pin < 16; ++pin)
    {
        if (PCF.read(pin))
        {
            pcfValue |= (1u << pin);
        }
    }
    uint16_t changed = pcfValue ^ pcfPrevValue;
    uint16_t activeEdges = 0;
    if (pcf_active_level == PCF_ACTIVE_LEVEL_HIGH)
    {
        activeEdges = changed & pcfValue;
    }
    else
    {
        activeEdges = changed & (~pcfValue);
    }
    pcfPrevValue = pcfValue;
    if (!activeEdges)
    {
        return;
    }
    for (uint8_t pin = 0; pin < PCF_CHANNEL_COUNT; ++pin)
    {
        if ((activeEdges & (1u << pin)) == 0)
        {
            continue;
        }
        int16_t mappedTrack = pcf_track_map[pin];
        if (mappedTrack < 0)
        {
            Serial.printf("PCF channel %u disabled\n", pin);
            continue;
        }
        Serial.printf("PCF channel %u triggered -> track %d\n", pin, mappedTrack);
        if (play_track_by_index((uint16_t)mappedTrack))
        {
            send_esp_now_play_track((uint16_t)mappedTrack);
        }
        break;
    }
}

void poll_button_state(t_button_state &button, uint32_t now_ms)
{
    bool reading = digitalRead(button.gpio);

    if (reading != button.last_reading)
    {
        button.last_reading = reading;
        button.last_change_ms = now_ms;
    }

    if ((uint32_t)(now_ms - button.last_change_ms) >= BUTTON_DEBOUNCE_MS && button.stable_state != reading)
    {
        button.stable_state = reading;
        if (is_button_active_level(button.gpio, button.stable_state))
            handle_button_pressed(button.gpio);
    }
}

void poll_buttons()
{
    uint32_t now_ms = millis();
    poll_button_state(button_states[0], now_ms);
    poll_button_state(button_states[1], now_ms);
}

void handle_pending_esp_now_commands()
{
    if (!esp_now_pending_packet)
        return;

    t_esp_now_packet packet = {};
    uint8_t packet_format = 0;
    portENTER_CRITICAL(&esp_now_mux);
    packet = esp_now_packet_to_handle;
    packet_format = esp_now_packet_format_to_handle;
    esp_now_pending_packet = false;
    esp_now_packet_format_to_handle = 0;
    portEXIT_CRITICAL(&esp_now_mux);

    if (packet_format == ESP_NOW_PACKET_VERSION_LEGACY)
    {
        mark_esp_now_activity();
        Serial.printf("ESP-NOW legacy track received: %u\n", packet.track_index);
        if (should_skip_remote_duplicate_play(packet.track_index))
        {
            Serial.printf("Ignoring duplicate remote track (legacy): %u\n", packet.track_index);
        }
        else
        {
            play_track_by_index(packet.track_index);
        }
        return;
    }
    if (packet_format != ESP_NOW_PACKET_VERSION)
    {
        return;
    }

    if (packet.origin_id == device_id)
    {
        return;
    }
    mark_esp_now_activity();
    if (has_seen_mesh_message(packet.origin_id, packet.message_id))
    {
        return;
    }
    remember_mesh_message(packet.origin_id, packet.message_id);

    Serial.printf("ESP-NOW track received: %u (ttl:%u)\n", packet.track_index, packet.ttl);
    if (should_skip_remote_duplicate_play(packet.track_index))
    {
        Serial.printf("Ignoring duplicate remote track: %u\n", packet.track_index);
    }
    else
    {
        play_track_by_index(packet.track_index);
    }

    if (is_relay_mode(device_mode) && packet.ttl > 0)
    {
        t_esp_now_packet relay_packet = packet;
        relay_packet.ttl = packet.ttl - 1;
        delay(random(4, 15));
        send_esp_now_packet((const uint8_t *)&relay_packet, sizeof(relay_packet));
    }
}

void handleDelete(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    audio.stopSong();

    StaticJsonDocument<2048> doc;

    DeserializationError error = deserializeJson(doc, data, len);
    if (error)
    {
        Serial.println(error.c_str());
        return;
    }
    int file_index = doc["index"].as<int>();
    if (file_index < 0 || file_index >= (int)music_data.size())
    {
        request->send(400, "text/plain", "Invalid file index");
        return;
    }
    String path_to_remove = music_data[file_index].path;
    Serial.printf("Removing file %d (%s)\n", file_index, path_to_remove.c_str());
    SD.remove(path_to_remove.c_str());
    update_music_from_sd();
    update_spiffs();
    request->send(200);
}

void handleStop(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    audio.stopSong();
    request->send(200);
}

void handleReorder(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    DynamicJsonDocument doc(2048);
    DeserializationError error = deserializeJson(doc, data, len);
    if (error || !doc.containsKey("paths"))
    {
        request->send(400, "text/plain", "Invalid reorder payload");
        return;
    }

    JsonArray paths = doc["paths"].as<JsonArray>();
    if (paths.isNull() || paths.size() == 0)
    {
        request->send(400, "text/plain", "No paths provided");
        return;
    }

    std::vector<String> ordered_paths;
    ordered_paths.reserve(paths.size());
    for (JsonVariant value : paths)
    {
        String candidate = value.as<String>();
        if (candidate.length() > 0)
        {
            ordered_paths.push_back(candidate);
        }
    }
    if (ordered_paths.size() == 0)
    {
        request->send(400, "text/plain", "No valid paths provided");
        return;
    }

    update_music_from_sd();
    apply_reordered_paths(ordered_paths);
    update_spiffs();
    request->send(200, "application/json", local_vars_to_json());
}

void handleSimulateButton(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    DynamicJsonDocument doc(256);
    DeserializationError error = deserializeJson(doc, data, len);
    if (error || !doc.containsKey("gpio"))
    {
        request->send(400, "text/plain", "Invalid simulate payload");
        return;
    }

    int gpio = doc["gpio"].as<int>();
    if (gpio != BUTTON_GPIO_13 && gpio != BUTTON_GPIO_16)
    {
        request->send(400, "text/plain", "Unsupported GPIO");
        return;
    }

    handle_button_pressed((uint8_t)gpio);
    request->send(200);
}

void handleSettings(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    String previous_ap_ssid = ap_ssid;
    String previous_ap_name = ap_name;
    String previous_ap_password = ap_password;
    String previous_ap_ip_config = ap_ip_config;
    uint8_t previous_device_mode = device_mode;
    uint16_t previous_ap_safety_timeout_s = ap_safety_timeout_s;
    uint8_t previous_channel = esp_now_channel;
    unsigned int previous_udp_port = localPort;

    Serial.printf("Handle settings body size: %u\n", len);
    json_to_local_vars(data, len);
    sanitize_network_settings();
    apply_button_input_config();
    apply_pcf_input_config();
    update_spiffs();

    bool network_changed = previous_ap_ssid != ap_ssid ||
                           previous_ap_name != ap_name ||
                           previous_ap_password != ap_password ||
                           previous_ap_ip_config != ap_ip_config ||
                           previous_device_mode != device_mode ||
                           previous_ap_safety_timeout_s != ap_safety_timeout_s ||
                           previous_channel != esp_now_channel ||
                           previous_udp_port != localPort;

    // StaticJsonDocument<2048> doc;
    printf("Json to send : %s\n", local_vars_to_json().c_str());
    // DeserializationError error = deserializeJson(doc, data);
    // if (error)
    // {
    //     Serial.println(error.c_str());
    //     return;
    // }
    // int file_index = doc["index"].as<unsigned int>();
    // Serial.printf("Playing file %d\n", file_index);
    // audio.connecttoFS(SD, files_list[file_index].c_str());

