juthomas/I2S-ESP32-SD/src/main.cpp
    request->send(200);
    if (network_changed)
    {
        schedule_restart(700);
    }
}

void handlePlay(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
    StaticJsonDocument<2048> doc;

    DeserializationError error = deserializeJson(doc, data, len);
    if (error)
    {
        Serial.println(error.c_str());
        return;
    }
    int file_index = doc["index"].as<unsigned int>();
    Serial.printf("Playing file %d\n", file_index);
    play_track_by_index(file_index);
    request->send(200);
}
void handleRequest(AsyncWebServerRequest *request)
{
    String filePath = request->url(); // Obtenez l'URL demandée
    int query_index = filePath.indexOf('?');
    if (query_index >= 0)
    {
        filePath = filePath.substring(0, query_index);
    }
    filePath = decode_url_path(filePath);

    // Vérifier si le fichier existe sur la carte SD
    if (SD.exists(filePath))
    {
        String contentType = getContentType(filePath);
        request->send(SD, filePath, contentType, true);
        return;
    }

    // Si le fichier n'existe pas ou s'il y a une erreur, renvoyer une réponse 404
    request->send(404, "text/plain", "File not found on sd card");
}
File uploadFile;
void handleFileUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
    if (request->url() != "/edit")
        return;
    // S'il s'agit du premier fragment du fichier, ouvrir le fichier en écriture
    if (index == 0)
    {
        if (SD.exists((char *)filename.c_str()))
            SD.remove((char *)filename.c_str());
        uploadFile = SD.open(filename.c_str(), FILE_WRITE);
        Serial.print("Upload: START, filename: ");
        Serial.println(filename);
        // Serial.println(filename);
        Serial.printf("Len : %d\n", len);
    }

    // Écrire les données dans le fichier
    if (uploadFile)
    {
        if (uploadFile)
            uploadFile.write(data, len);
        Serial.print("Upload: WRITE, Bytes: ");
        Serial.println(len);
    }

    // S'il s'agit du dernier fragment du fichier, fermer le fichier
    if (final)
    {
        if (uploadFile)
            uploadFile.close();
        Serial.print("Upload: END :");
        Serial.println(len);
        update_music_from_sd();
        update_spiffs();
        request->send(200);
    }
}

bool has_web_serial_provision_marker()
{
    return SPIFFS.exists(WEB_SERIAL_PROVISION_STATE_FILE);
}

void mark_web_serial_provision_done()
{
    fs::File marker = SPIFFS.open(WEB_SERIAL_PROVISION_STATE_FILE, "w");
    if (!marker)
    {
        return;
    }
    marker.print("done");
    marker.close();
}

bool apply_web_serial_config_json(const String &json_payload)
{
    DynamicJsonDocument validation_doc(SETTINGS_DOC_CAPACITY);
    DeserializationError validation_error = deserializeJson(validation_doc, json_payload);
    if (validation_error)
    {
        Serial.printf("WEBCFG:INVALID:%s\n", validation_error.c_str());
        return false;
    }

    json_to_local_vars((const uint8_t *)json_payload.c_str(), json_payload.length());
    sanitize_network_settings();
    apply_button_input_config();
    apply_pcf_input_config();
    update_spiffs();
    return true;
}

void handle_first_boot_serial_provisioning()
{
    if (has_web_serial_provision_marker())
    {
        return;
    }

    Serial.println("WEBCFG:WINDOW_START");
    uint32_t deadline_ms = millis() + WEB_SERIAL_PROVISION_WINDOW_MS;
    uint32_t last_ready_ms = 0;
    String serial_line = "";
    serial_line.reserve(256);
    bool config_received = false;
    bool config_changed = false;

    while ((int32_t)(millis() - deadline_ms) < 0)
    {
        uint32_t now_ms = millis();
        if (now_ms - last_ready_ms >= WEB_SERIAL_PROVISION_READY_INTERVAL_MS)
        {
            Serial.printf("WEBCFG:READY:%lu\n", (unsigned long)WEB_SERIAL_PROVISION_WINDOW_MS);
            last_ready_ms = now_ms;
        }

        while (Serial.available() > 0)
        {
            char c = (char)Serial.read();
            if (c == '\r')
                continue;

            if (c == '\n')
            {
                String received_line = serial_line;
                serial_line = "";
                received_line.trim();

                if (!received_line.startsWith(WEB_SERIAL_PROVISION_PREFIX))
                {
                    continue;
                }

                String payload = received_line.substring(strlen(WEB_SERIAL_PROVISION_PREFIX));
                payload.trim();
                String previous_json = local_vars_to_json();
                config_received = apply_web_serial_config_json(payload);
                if (config_received)
                {
                    config_changed = local_vars_to_json() != previous_json;
                    if (config_changed)
                    {
                        Serial.println("WEBCFG:APPLIED");
                    }
                    else
                    {
                        Serial.println("WEBCFG:NO_CHANGE");
                    }
                }
                break;
            }

            if (serial_line.length() < WEB_SERIAL_PROVISION_MAX_LINE)
            {
                serial_line += c;
            }
        }

        if (config_received)
        {
            break;
        }
        delay(5);
    }

    mark_web_serial_provision_done();
    if (config_changed)
    {
        delay(120);
        ESP.restart();
        return;
    }
    if (config_received)
    {
        Serial.println("WEBCFG:DONE");
        return;
    }
    Serial.println("WEBCFG:SKIP");
}

void setup()
{
    pinMode((int)START_BUTTON, INPUT_PULLUP);
    esp_sleep_enable_ext0_wakeup(START_BUTTON, 0);
    rtc_gpio_pulldown_dis((gpio_num_t)START_BUTTON);
    rtc_gpio_pullup_en((gpio_num_t)START_BUTTON);
    pinMode(I2S_ENABLE, OUTPUT);
    digitalWrite(I2S_ENABLE, HIGH);
    pinMode(CHRG_STATUS, INPUT);
    pinMode(USB_VOLTAGE_PIN, INPUT);
    pinMode(BATTERY_VOLTAGE_PIN, INPUT);
    analogSetWidth(12);
    analogSetPinAttenuation(USB_VOLTAGE_PIN, ADC_11db);
    analogSetPinAttenuation(BATTERY_VOLTAGE_PIN, ADC_11db);
    strip.begin();
    strip.setBrightness(led_brightness);
    strip.clear();
    strip.show();

    pinMode(SD_CS, OUTPUT);
    pinMode(2, OUTPUT); ///
    digitalWrite(2, 1); ///
    digitalWrite(SD_CS, HIGH);
    SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
    Serial.begin(115200);
    Wire.begin(21, 22);
    Wire.setClock(100000);
    if (!PCF.begin())
    {
        Serial.println("PCF8575 init failed");
        pcfReady = false;
    }
    else
    {
        pcfReady = true;
        apply_pcf_input_config();
    }
    pinMode(PCF_INT_PIN, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PCF_INT_PIN), onPcfInterrupt, FALLING);
    if (!SD.begin(SD_CS))
    {
        Serial.println("SD initialization failed!");
        while (1)
            ;
    }
    Serial.println("SD initialization done.");
    if (!SPIFFS.begin())
    {
        Serial.println("SPIFFS initialization failed !");
        while (1)
            ;
        // return;
    }
    Serial.println("SPIFFS initialization done.");
    load_json_config_on_sd("/config.json");

    load_spiffs();
    handle_first_boot_serial_provisioning();
    Serial.printf("JSON : %s/n", local_vars_to_json().c_str());

    uint64_t chip_id = ESP.getEfuseMac();
    device_id = (uint32_t)(chip_id & 0xFFFFFFFF);
    if (device_id == 0)
    {
        device_id = 1;
    }
    esp_now_message_counter = 1;
    last_esp_now_activity_ms = millis();
    ap_safety_ap_activated = false;

    sanitize_network_settings();
    apply_button_input_config();
    apply_pcf_input_config();
    if (is_ap_enabled_mode(device_mode))
    {
        start_soft_ap_runtime();
    }
    else
    {
        // AP-off mode: optionally start AP at boot for ap_safety_timeout_s (e.g. 5 min) so user can connect
        if (ap_safety_timeout_s > 0 && start_soft_ap_runtime())
        {
            ap_safety_ap_activated = true;
            ap_safety_activated_at_ms = millis();
            Serial.printf("AP safety window started at boot (%us)\n", ap_safety_timeout_s);
        }
        else
        {
            WiFi.mode(WIFI_STA);
            WiFi.setSleep(false);
            ap_runtime_enabled = false;
            ap_ip = "";
            esp_err_t channel_result = esp_wifi_set_channel(esp_now_channel, WIFI_SECOND_CHAN_NONE);
            if (channel_result != ESP_OK)
            {
                Serial.printf("Failed to set ESP-NOW channel: %d\n", channel_result);
            }
        }
    }
    digitalWrite(2, 0);
    udp.begin(localPort);
    init_esp_now();
    if (DEBUG)
    {
        Serial.printf("Device mode: %u\n", device_mode);
        Serial.printf("AP SSID: %s\n", ap_ssid.c_str());
        Serial.printf("AP Password: %s\n", ap_password.c_str());
        Serial.printf("AP IP: %s\n", ap_ip.c_str());
        Serial.printf("ESP-NOW channel: %u\n", esp_now_channel);
        Serial.printf("Mesh TTL: %u\n", mesh_ttl);
        Serial.printf("AP safety timeout: %us\n", ap_safety_timeout_s);
        Serial.printf("UDP port: %u\n", localPort);
        Serial.printf("GPIO14 cfg pull:%u active:%u track:%d\n", button_gpio13_pull_mode, button_gpio13_active_level, button_gpio13_track);
        Serial.printf("GPIO16 cfg pull:%u active:%u track:%d\n", button_gpio16_pull_mode, button_gpio16_active_level, button_gpio16_track);
        Serial.printf("PCF cfg pull:%u active:%u\n", pcf_pull_mode, pcf_active_level);
    }
    server.on("/", HTTP_ANY, [](AsyncWebServerRequest *request)
              { request->send(SPIFFS, "/index.html", String(), false); });
    // server.on(
    //     "/edit", HTTP_POST, [](AsyncWebServerRequest *request)
    //     { request->send(200); },
    //     handleFileUpload);
    server.on("/data", HTTP_GET, [](AsyncWebServerRequest *request)
              {Serial.printf("Json demandé par le site\n");
              request->send(200, "application/json", local_vars_to_json()); });
    server.on("/health", HTTP_GET, [](AsyncWebServerRequest *request)
              { request->send(200, "application/json", "{\"ok\":true}"); });
    server.on(
        "/play", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handlePlay);
    server.on(
        "/stop", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleStop);
    server.on(
        "/delete", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleDelete);
    server.on(
        "/settings", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleSettings);
    server.on(
        "/reorder", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleReorder);
    server.on(
        "/simulate_button", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleSimulateButton);
    server.on("/sleep", HTTP_POST, [](AsyncWebServerRequest *request)
              {
                  request_sleep();
                  request->send(200, "application/json", "{\"sleep\":true}");
              });
    server.onFileUpload(handleFileUpload);
    // server.on("/edit", HTTP_POST, handleFileUpload2);

    server.serveStatic("/index.css", SPIFFS, "/index.css");
    server.serveStatic("/index.js", SPIFFS, "/index.js");
    // server.serveStatic("/background.png", SPIFFS, "/background.png");
    // server.serveStatic("/react.svg", SPIFFS, "/react.svg");
    server.serveStatic("/vite.svg", SPIFFS, "/vite.svg");
    server.onNotFound(handleRequest);

    server.begin();

    audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT);
    update_music_from_sd();
    // printf("test : %s\n", files_list[1].c_str());
    if (auto_play)
    {
        play_track_by_index(0);
    }
    if (loop_file)
    {
        audio.setFileLoop(true);
    }

    audio.setVolumeSteps(255); // max 255
    audio.setVolume(volume);
}

bool need_to_play = true;

